/*"***********************************************************"*/		
/*"FileName: WDT.c "*/		
/*"Author: "*/     
/*"Version : 1.0       Date: 2017.01.5"*/	
/*"Description: 看门狗"*/
/*"Function List: "*/		
/*"<FunctionName>	"*/	
/*"<author> <time> <version > <desc>"*/			
/*"***********************************************************"*/	
#include "Driver\MCU\WDT.h"
#include "Driver\MCU\MCU.h"
/*"*******************初始化看门狗调用接口******************"*/
void WDT_Init(INT8U Mode)
{
    MCU_PeriphClkSet(IWDT_num,ENABLE);

    if( Mode == MCU_RUNMODE)//_MODE_RUN 
    {
        IWDT->IWDTCFG  = 0x0003;/*溢出时间为8秒，休眠后仍使用短周期*/
    }
    else
    {
        IWDT->IWDTCFG  = 0x0003;/*溢出时间为8秒，休眠后仍使用短周期*/
    }
}

/*"********************************看门狗喂狗调用接口******************************************"*/
/*"看门狗计数器清除条件：WDTCON寄存器中的内部指针WDP为0的条件下写入5AH，"*/
/*"在WDP为1的条件下写入ACH"*/
/*"WDT中断发生时，WDT 计数器和内部指针（WDP）会重新初始化"*/
/*"******************************************************************************************************"*/
void WDT_FeedWdg(void)
{
    IWDT->IWDTSERV  = 0x12345A5A;/*溢出时间为8秒，休眠后仍使用短周期*/
}




















